cf/Catalogs/МоделиБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МоделиБюджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоАналитик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики1</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики2</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики3</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/МоделиБюджетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоказателиСтатьяБюджетаПриИзменении(Элемент)
	ТекДанные=Элементы.Показатели.ТекущиеДанные;
	Струк=ПолучитьТипАналитики(ТекДанные.СтатьяБюджета);
	ТекДанные.ТипАналитики1=Струк.ТипАналитики1;
	ТекДанные.типАналитики2=Струк.ТипАналитики2;
	ТекДанные.типАналитики3=Струк.ТипАналитики3;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипАналитики(Статья)
	Возврат Новый Структура("ТипАналитики1,ТипАналитики2,ТипАналитики3",Статья.ТипАналитики1,Статья.ТипАналитики2,Статья.ТипАналитики3);
КонецФункции

&НаСервере
Процедура УправлениеВидимостью()
	 КолАналитик=Объект.КоличествоАналитик;
	 Для Н=1 По 3 Цикл
		Использование=?(Н<=КолАналитик, Истина, Ложь);
		Элементы.Показатели.ПодчиненныеЭлементы["ПоказателиАналитика"+Н].Видимость=Использование;
		Элементы.Показатели.ПодчиненныеЭлементы["ПоказателиТипАналитики"+Н].Видимость=Использование;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостью();
КонецПроцедуры


&НаКлиенте
Процедура КоличествоАналитикПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры
